<?php
$_['heading_title']          = 'Статьи и обзоры';
// Text
$_['text_article']          = 'Статьи';
$_['text_related']          = 'Похожие статьи';
$_['text_related_products'] = 'Рекомендуемые товары';
$_['text_attributes']   	= 'Дополнительные поля';
$_['text_tags']             = 'Теги:';
$_['text_list']             = 'Список статей';

// Entry
$_['entry_qty']             = 'Кол-во';
$_['entry_name']            = 'Ваше имя:';
$_['entry_review']          = 'Ваш отзыв';
$_['entry_rating']          = 'Рейтинг';
$_['entry_good']            = 'Хорошо';
$_['entry_bad']             = 'Плохо';
$_['column_name']           = 'Наименование статьи';
$_['column_status']         = 'Статус';
$_['column_date_available'] = 'Добавлено';
$_['column_date_modified']  = 'Изменено';
$_['column_action']         = 'Действия';

//
//
$_['text_enabled']         = 'Отображается';
//
$_['column_action']         = 'Действия';
$_['button_add']            = 'Написать статью';
$_['button_edit']           = 'Редактировать';
// Error
$_['error_name']            = 'Имя должно быть от 3 до 25 символов!';
$_['error_text']            = 'Текст Отзыва должен быть от 25 до 1000 символов!';
$_['error_rating']          = 'Пожалуйста поставьте оценку!';


//
$_['entry_name_article'] = 'Название статьи';
$_['entry_preview'] = 'Краткое содержание статьи';
$_['entry_description'] = 'Полное содержание статьи';
$_['entry_meta_title'] = 'Заголовок статьи';
$_['entry_meta_h1'] = 'Заголовок h1';
$_['entry_meta_description'] = 'Мета описание';
$_['entry_meta_keyword'] = 'Мета ключевые слова';
$_['entry_tag'] = 'Тэги';
$_['text_add'] = 'Оформить статью';

$_['button_save'] = 'Сохранить статью и отправить на модерацию';
$_['entry_related'] = 'Похожие статьи';
$_['entry_related_products'] = 'Товар из статьи';
$_['text_description'] = 'Зарабатывайте на ваших статьях и обзорах. Вставляйте ваш код партнёра'
        . ' к товару. При переходе и покупке товара клиентом из вашей статьи или обзора вам начисляется'
        . ' процент от суммы покупок.';

$_['text_disabled'] = 'Проходит модерацию';
$_['text_edit'] = 'Редактирование статьи';
$_['text_success'] = 'Операция выполнена успешно';