<?php
// Heading
$_['heading_title']    			= ' Light checkout 3.0 / Упрощенный заказ Opencart 3.0';

$_['text_extension']    		= 'Расширения';

// Tab
$_['text_settings']    			 = 'Настройки';
$_['text_structure']   			 = 'Структура';
$_['text_html']   		 	 	 = 'HTML';
$_['text_localisation']   		 = 'Локализация';
$_['text_seo_url']   		 	 = 'SEO URL';
$_['text_restrictions']   		 = 'Ограничения';
$_['text_template']   		 	 = 'Интеграция';
$_['text_payment']   		 	 = 'Статус Заказа';

$_['text_structure_help']   	 = 'Задайте оптимальное расположение блоков, передвигая блоки, указанные справа.';
$_['text_structure_toggle_help'] = 'Поддерживается режим управления мышью Drag&Drop';
$_['text_width_help']   	 	 = 'Также можно задать размер текущих колонок, в которых располагаются блоки';
$_['text_width_toggle_help']   	 = 'Для этого необходимо передвинуть синие ползунки влево-вправо';


// Fields
$_['text_name_porpose']      	 = 'Наименование поля';
$_['text_show']      			 = 'Отображать';
$_['text_required']      		 = 'Обязательно';
$_['text_name_fields']      	 = 'Переименование поля';
$_['text_placeholder_fields']    = 'Placeholder поля';
$_['text_sort']    				 = 'Сортировка';

// Help
$_['text_help_setting_element']  = 'Выбор полей для отображения';

// Block
$_['text_cart']    				 	= 'Корзина';
$_['text_confirm']    			 	= 'Подтверждение заказа';
$_['text_alogin']    			 	= 'Регистрация / Авторизация';
$_['text_payment_address']  	 	= 'Данные клиента';
$_['text_shipping']    			 	= 'Адрес доставки';
$_['text_shipping_method']    	 	= 'Способ доставки';
$_['text_payment_method']    	 	= 'Способ оплаты';

$_['text_checked_fields']    	 	= 'Настроить поля';
$_['text_checked_payment_method']	= 'Выбрать методы оплаты';
$_['text_checked_shipping_method']	= 'Выбрать методы оплаты';

// Help
$_['text_cart_help']    		 = 'Отображение блока корзины';
$_['text_confirm_help']    		 = 'Блок подтверждения заказа';
$_['text_alogin_help']    		 = 'Блок Авторизации / Регистрации и Заказа Без Регистрации';
$_['text_payment_address_help']  = 'Адрес и личные данные клиента.<br /><br /><span style="font-size:11px;">При включенном блоке "Регистрация / Авторизация" используется в связке с ним.</span>';
$_['text_shipping_help']    	 = 'Блок отображается, если товару необходима доставка и Адрес доставки не совпадает с Платежным (регистрационным)';
$_['text_shipping_method_help']  = 'Блок выбора Метода доставки. Появляется, если товару необходима доставка и определяется исходя из географической зоны Адреса доставки';
$_['text_payment_method_help']  = 'Блок выбора метода оплаты. Определяется исходя из географической зоны Адреса клиента';

// Alogin Block
$_['text_register']    				= 'Регистрация';
$_['text_register_required_help']   = 'При выборе этого параметра Режим  - Оформить заказ без регистрации - будет недоступен';
$_['text_guest']    				= 'Оформить заказ без регистрации';
$_['text_guest_required_help']   	= 'При выборе этого параметра Режим  - Регистрация - будет недоступен';
$_['text_checkout_guest'] 			= 'Оформить заказ';


$_['text_firstname']    			= 'Имя';
$_['text_lastname']    				= 'Фамилия';
$_['text_phone']    				= 'Телефон';
$_['text_email']    				= 'E-mail';
$_['text_letter']    				= 'Я хочу подписаться на рассылку новостей';
$_['text_batches_address']    		= 'Мой адрес доставки совпадает с платёжным';
$_['text_agree']    				= 'Я прочитал(-а) Политика безопасности и согласен(-на) с условиями';
$_['text_custom']    				= 'Настраиваемые поля';
$_['text_guest_custom']    			= 'Настраиваемые поля';
$_['text_custom_account']    		= 'Настраиваемые поля';

$_['text_company']    				= 'Компания';
$_['text_address_1']    			= 'Адрес 1';
$_['text_address_2']    			= 'Адрес 2';
$_['text_city']    					= 'Город';
$_['text_postcode']    				= 'Почтовый индекс';
$_['text_country']    				= 'Страна';
$_['text_zone']    					= 'Регион/Область';


$_['text_guest_firstname']    		= 'Имя';
$_['text_guest_lastname']    		= 'Фамилия';
$_['text_guest_phone']    			= 'Телефон';
$_['text_guest_email']    			= 'E-mail';
$_['text_guest_company']    		= 'Компания';
$_['text_guest_address_1']    		= 'Адрес 1';
$_['text_guest_address_2']    		= 'Адрес 2';
$_['text_guest_city']    			= 'Город';
$_['text_guest_postcode']    		= 'Почтовый индекс';
$_['text_guest_country_id']    		= 'Страна';
$_['text_guest_zone_id']    		= 'Регион/Область';

$_['text_alogged']    			 	= 'Вход по логину';
$_['text_placeholder_alogged']    	= 'Войти';

// Shipping Address Block
$_['text_shipping_firstname']    	= 'Имя';
$_['text_shipping_lastname']    	= 'Фамилия';
$_['text_shipping_telephone']    	= 'Телефон';
$_['text_shipping_email']    		= 'E-mail';
$_['text_shipping_company']    		= 'Компания';
$_['text_shipping_address_1']    	= 'Адрес 1';
$_['text_shipping_address_2']    	= 'Адрес 2';
$_['text_shipping_city']    		= 'Город';
$_['text_shipping_postcode']    	= 'Почтовый индекс';
$_['text_shipping_country_id']    	= 'Страна';
$_['text_shipping_zone_id']    		= 'Регион/Область';
$_['text_shipping_custom']    		= 'Настраиваемые поля';

// Payments Address Block
$_['text_country_id']    			= 'Страна';
$_['text_zone_id']    				= 'Регион/Область';
$_['text_fields']    				= 'Настраиваемые поля';

// Payments Method Block
$_['text_payment_comment']    		= 'Комментарий к заказу';
$_['text_payment_agree']    		= 'Условия соглашения';

// Shipping Method Block
$_['text_shipping_comment']    		= 'Комментарий к заказу';

// Help
$_['text_help_shipping_custom']    	= 'Раздел Покупатели - Настраиваемые поля';
$_['text_help_custom']    			= 'Раздел Покупатели - Настраиваемые поля';
$_['help_register']    				= 'Для блока Регистрация';
$_['help_guest']    				= 'Для блока Оформление заказа без Регистрации';
$_['help_postcode']    				= 'Индекс все равно будет обязателен, если задано в настройках соотв. страны в Система - Локализация - Страны, независимо от текущей настройки';
$_['help_custom']    				= 'Обязательность поля задается в разделе Покупатели - Настраиваемые поля';
$_['help_show_custom']    						= 'Поле будет отображаться, если в настройках в разделе Покупатели - Настраиваемые поля указано Расположение АДРЕС';
$_['help_show_custom_account']  				= 'Поле будет отображаться, если в настройках в разделе Покупатели - Настраиваемые поля указано Расположение АККАУНТ';
$_['help_text_custom']    						= 'раздел Покупатели - Настраиваемые поля';
$_['text_help_batches_address']    				= 'Не будет отображаться, если блок ДАННЫЕ КЛИЕНТА отключен или товару не требуется доставка';
$_['text_help_payment_method']    				= 'Системное наименования модуля оплаты';
$_['text_help_shipping_method']    				= 'Системное наименования модуля доставки';
$_['text_help_payment_placeholder_method']    	= 'Заголовок модуля оплаты';
$_['text_help_payment_agree']    				= 'Блок будет отображаться, если одновременно указано ПОДТВЕРЖДЕНИЕ ПРИ ЗАКАЗЕ в Система - Настройки, вкладка Опции';
$_['text_help_seo_url_on_1']    			= 'Для работы ссылок необходимо переименовать файл <b>.htaccess.txt</b> в <b>.htaccess</b>, а также включить соотв. настройки в разделе Система - Настройки';
$_['text_help_seo_url_on_2']    			= 'Ссылки, указанные ниже, будут доступны для указанных выше магазинов.';
$_['text_help_seo_url_on_3']    			= 'Внимание! Движок может не поддерживать одинаковые ЧПУ alias для разных языков, поэтому рекомендуется сделать из разными';
$_['text_help_localization']    			= 'Задайте значение Страны и Региона, для которого будут автоматически выдан список способов Доставки и Оплаты.';

// Tooltip
$_['tooltip_rename_help']			= 'Если поле не заполнено, будут использоваться значения по-умолчанию';
$_['tooltip_register']    			= 'Дополнительно поля для регистрации, кроме тех, что здесь настраиваются, будут браться из блока ДАННЫЕ КЛИЕНТА, если этот блок включен.';
$_['tooltip_guest']    				= 'При оформлении заказа в режиме ЗАКАЗ БЕЗ РЕГИСТРАЦИИ, поля этого блока, что здесь отдельно настраиваются, будут автоматически перемещены в блок ДАННЫЕ КЛИЕНТА, если этот блок включен, и заменят поля его блока при оформлении заказа';
$_['tooltip_payment_methods']    	= 'Здесь отображаются только активные модули Оплаты, указанные в разделе Расширения - Расширения - выбрать в списке Оплата (или Платежи)';
$_['tooltip_shipping_methods']    	= 'Здесь отображаются только активные модули Доставки, указанные в разделе Расширения - Расширения - выбрать в списке Доставка';

// Text
$_['text_module']      				 = 'Модули';
$_['text_success']     				 = 'Настройки успешно изменены!';
$_['text_edit']        				 = 'Редактирование';

// Alert
$_['text_success']        			 = 'Данные успешно сохранены';
$_['text_checked_payment_address_1'] = 'Поля, представленные ниже, будут использоваться как независимо в блоке ДАННЫЕ КЛИЕНТА (если регистрация отключена), так и для Регистрации при заказе (если регистрация включена), но не для режима ЗАКАЗ БЕЗ РЕГИСТРАЦИИ.';
$_['text_checked_payment_address_2'] = 'Настройка и выбор полей для режима ЗАКАЗ БЕЗ РЕГИСТРАЦИИ происходит отдельно в блоке АВТОРИЗАЦИЯ/РЕГИСТРАЦИЯ.';
$_['text_debugging'] 				 = 'Включен режим Отладки/Проверки. В этом режиме модуль доступен только по техническому адресу <a target="_blank" href="%s" alt="Технический адрес модуля" title="Технический адрес модуля"><strong>%s</strong></a> (если в корзине присутствует товар)';
$_['text_checked_cart']        		 = 'Выберите модули, которые могут учитываться в заказе и отображаются в блоке Корзина.';
$_['text_checked_cart_dop']        	 = 'Модули будут работать, если одновременно включены в разделе Расширения - Расширения - Учитывать в заказе.';
$_['text_alert_restrictions']         = 'Выберите ограничения заказа по сумме, количеству и весу для разных групп покупателя';
$_['text_alert_cart_template_start'] = 'Системные настройки (используются редко, зависит от шаблона)';
$_['text_alert_cart_template']       = 'Миникорзина в шапке сайта';
$_['text_alert_cart_js_template']    = 'Код Javascript при обновлении корзины.';
$_['text_alert_cart_js_template_1']  = 'Будьте внимательны при вставке этого кода. Неправильный код может привести к ошибке и неработоспособности модуля';
$_['text_alert_cart_js_template_2']  = 'Дополнительно в поле ниже Вы можете задать пользовательские стили CSS';
$_['text_alert_cart_css_template']   = 'Файл стилей модуля нах-ся по адресу catalog\view\theme\default\stylesheet\lightcheckout.css';

// Entry
$_['entry_status']     				 = 'Статус модуля';
$_['entry_default_country_id']     	 = 'Страна по-умолчанию';
$_['entry_default_zone_id']     	 = 'Регион по-умолчанию';
$_['entry_skip_cart']     			 = 'Пропустить КОРЗИНУ';
$_['entry_debugging']     			 = 'Режим отладки';
$_['entry_bootstrap']     			 = 'Подключение Bootstrap';
$_['entry_font']     			 	 = 'Подключение файла иконок<br /> Font awesome';
$_['entry_jquery']     			 	 = 'Подключение бибилиотеки<br /> Jquery';
$_['entry_light']     			 	 = 'Подсветка полей<br /> при ошибке';
$_['entry_error']     			 	 = 'Показывать текст<br /> ошибки';
$_['entry_min_summa']     			 = 'Минимальная сумма<br />для заказа, в валюте ';
$_['entry_qty']     			 	 = 'Количество товара<br /> в Корзине';
$_['entry_html_top']     			 = 'HTML текст перед формой';
$_['entry_html_bottom']     		 = 'HTML текст после формы';
$_['entry_coupon']     		 		 = 'Купоны';
$_['entry_reward']     		 		 = 'Бонусные баллы';
$_['entry_voucher']     		 	 = 'Подарочные сертификаты';

$_['entry_seo_store']     			 = 'Магазины';
$_['entry_seo_url']     			 = 'Значение URL страницы Оформления заказа';

// Help Entry
$_['entry_help_status']     		 = 'Включить и отключить текущий модуль';
$_['entry_help_skip_cart']     		 = 'Все ссылки на Корзину заменяются ссылками на страницу Оформления заказа';
$_['entry_help_debugging_domen']     = 'Технический адрес';
$_['entry_help_debugging']     		 = 'Для тестирования работы модуля. Страница модуля будет доступна только по техническому адресу, когда в корзине присутствует товар';
$_['entry_help_bootstrap']     		 = 'Если в шаблоне отсутствует Bootstrap, то для корректной работы модуля его необходимо включить здесь';
$_['entry_help_localization']     	 = 'Если значение не будет указано, оно будет назначено в соотв. с настройками, указанными в Система - Настройки';
$_['entry_help_seo_url']     		 = 'Url alias для каждого языка. ';
$_['entry_help_seo_store']     		 = 'Укажите для какого магазина использовать url алиас, указанный ниже';
$_['entry_help_light']     		 	 = 'Подсветка обязательных к заполнению полей при ошибке';
$_['entry_help_error']     		 	 = 'Поясняющий текст под полем, сообщающий об ошибке заполнения или выбора';
$_['entry_help_min_summa']     		 = 'Минимальная сумма для заказа, позволяющая оформить заказ. Данное значение указывается в текущей валюте, коэффициент которой в разделе Система - Локализация - Валюты равен единице';
$_['entry_help_min_summa_2']     	= '. Если на сайте будет выбрана другая Валюта, данное значение пересчитается по курсу Автоматически на странице Оформления заказа';
$_['entry_help_qty']     			= 'Возможность изменить количество товара в Корзине модуля';
$_['entry_help_font']     			= 'Если в шаблоне отсутствует загрузка шрифта font awesome, для показа иконок модуля загрузку этого шрифта можно включить здесь';
$_['entry_help_jquery']     		= 'Если в шаблоне отсутствует загрузка JQuery, или онf загружается в подвале сайта, для нормальной работы модуля здесь можно включить загрузку этой библиотеки.';
$_['entry_help_html_top']     		= 'HTML текст выше формы заказа';
$_['entry_help_html_bottom']     	= 'HTML текст ниже формы заказа';
$_['entry_help_coupon']     		= 'Возможность вставки купона в блоке Корзина';
$_['entry_help_reward']     		= 'Отображение Бонусных баллов в блоке Корзина. Доступно, если в разделе Покупатели - Покупатели указаны соотв. баллы для конкретного покупателя';
$_['entry_help_voucher']     		= 'Возможность Подарочного сертификата в блоке Корзина';
$_['text_help_cart_template_1']      = 'Разные шаблоны могут использовать разный текст отображения кол-ва и цены в Миникорзине, все зависит от текущего значения языковой переменной <strong>text_items</strong>.<br /><br /><strong> Это значение может нах-ся в том числе и в следующих языковых файлах:</strong>';
$_['text_help_cart_template_2']      = 'в любых других файлах по адресу catalog/language/{текущий язык}/';
$_['text_help_cart_template_3']      = 'По-умолчанию используется данное значение $_[\'text_items\']     = \'<strong>Товаров: <span style="color: red;">%s</span> (<span style="color: green;">%s<span>)</strong>\';<br />где первый символ <strong style="color: red;">%s</strong> - это <strong>количество</strong>,а второй <strong style="color: green;">%s</strong> - <strong>итоговая сумма</strong>.';
$_['text_help_cart_template_4']      = 'В поле ниже автоматически была указана найденная в языковых файлах Вашего движка переменная <strong>text_items</strong>. Если она не соответствует вашей переменной, вставьте ее значение в поле ниже вместо текущих:';
$_['text_help_cart_template_5']      = 'catalog/language/{текущий язык}/common/cart.php';
$_['text_help_cart_template_6']      = 'catalog/language/{текущий язык}/checkout/cart.php';
$_['text_help_cart_template_7']      = 'Если в файле <strong>catalog/language/{текущий язык}/lightcheckout/themes.php</strong> уже <strong>указана переменная для вашего шаблона</strong>, то она будет автоматически использоваться, взамен той, что указана Выше. Данные переменные в этом файле будут постоянно пополняться.';
$_['text_help_cart_template_8']      = 'Если в файле <strong>catalog\view\javascript\lightcheckout\lightcheckout.js</strong> уже <strong>указаны скрипты для вашего шаблона</strong>, то они будут автоматически использоваться. Данные скрипты в этом файле будут постоянно пополняться.';

// Error
$_['error_permission'] 				 = 'У вас недостаточно прав для внесения изменений!';
$_['error_address'] 				 = 'Нельзя одновременно отключить блоки "Адрес Доставки" и "Данные клиента". Отключается что-то одно, любой из этих блоков';
$_['error_status'] 					 = 'Нельзя одновременно отключить блоки "Регистрация/Авторизация", "Адрес Доставки" и "Данные клиента". Необходим включить хотя бы один из этих блоков';
$_['error_register']     			 = 'Не выбрано ни одно поле Регистрации. Регистрация при оформлении заказа будет отключена!';
$_['error_guest']     				 = 'Не выбрано ни одно поле Оформления заказа без регистрации. Оформление заказа без регистрации будет отключено!';
$_['error_seo_url']     			 = 'Такой SEO URL уже используется для ссылки <b>%s</b>!';
$_['error_seo_url_empty_store'] 	 = 'Не выбран Магазин, к которому применять URL алиас';
$_['error_double_restriction'] 	 	 = 'Устраните дубли ограничений заказа во вкладке "Ограничения".';
$_['error_max_restriction'] 	 	 = 'Максимальное значение параметра не может быть равно нулю. Просто уберите его из списка ограничений.';

// Info
$_['text_info_system']              = 'Системные настройки';
$_['text_info_more']                = 'Дополнительные настройки';

$_['text_or']              			= ' или ';


//Restriction
$_['entry_restriction']             = 'Тип ограничения';
$_['entry_group_customer']          = 'Группа покупателей';
$_['entry_restriction_value']       = 'Значение';
$_['type_restriction_min_summa']    = 'Минимальная сумма';
$_['type_restriction_max_summa']    = 'Максимальная сумма';
$_['type_restriction_min_qty']      = 'Минимальное количество';
$_['type_restriction_max_qty']    	= 'Максимальное количество';
$_['type_restriction_min_weight']   = 'Минимальный вес';
$_['type_restriction_max_weight']   = 'Максимальный вес';


// Activation
$_['heading_title_title']                       = 'Активация управления модулем Упрощенный заказ 3.0';

$_['protection']                                = ' * Введите Cекретный код модуля:';
$_['help_protection']                           = 'Данный секретный код вам нужно запросить у автора, связавшись со мной по контактам: <span style="color: #FA0000; font-weight: bold;">aleksandr.rostov@mail.ru</span> или skype: <span style="color: #FA0000; font-weight: bold;">aleks.rostov85</span>, предварительно указав <span style="text-decoration: underline;">точное время покупки модуля</span>, а также <span style="text-decoration: underline;">название своего домена</span>, на котором установлен модуль.<br />';
$_['help_cod_protection']                       = 'Помните, что секретный код привязан к вашему домену, с другим доменом данный модуль работать не будет';
$_['protection_no_base']                        = 'Вы используете локальный домен. Нажмите кнопку <span style="color: #FA0000;">СОХРАНИТЬ</span> и заново зайдите в модуль, он должен автоматически открыться';
$_['helping_ptotection']                        = '(требуется активация модуля)';

$_['text_activation']                   		= 'Активация управления модулем Упрощенный заказ 3.0';
$_['text_domen']                   				= 'Домен: ';
$_['text_keys']                   				= 'Ключ: ';
$_['text_help_code']                   			= 'Запрашивая и/или вводя Cекретный код, Вы соглашаетесь на обработку персональных данных (домен и секретный код) в соответствии с Федеральным законом Российской Федерации 152-ФЗ.';

$_['text_module']      							= 'Модули';
$_['text_success']     							= 'Настройки успешно изменены!';
$_['text_edit']        							= 'Редактирование';
$_['text_protection_help']        				= 'Введите в это поле ключ активации модуля';
$_['text_error_code']        					= 'Введенный Вами код активации неверен! Для более корректной генерации кода, необходимо указать на <span style="text-decoration: underline;">aleksandr.rostov@mail.ru</span> ваш текущий домен, а именно: <strong>%s</strong>';
$_['text_error_modification']        			= '<html dir="ltr" lang="ru"><head><meta charset="UTF-8" /></head><body>Вы забыли обновить кеш модификаторов в разделе Расширения - Расширения - Модификаторы (или Менеджер дополнений)!!!</body>';

// Payments
$_['text_alert_payment']   				= 'Статусы заказов указываются в соответствующих модулях Оплаты в разделе Расширения - Расширения - Платежи (или Оплата)';
$_['text_alert_payment_status']   		= 'В случае, если Выбор методов Оплаты отключен, здесь можно выбрать текущий статус Заказа.';
$_['entry_payment_status']   			= 'Статус Заказа';
$_['entry_help_payment_status']   		= 'Текущий статус заказа будет работать только в случае, когда Выбор Методов оплаты не доступен.';






