<?php
// Heading
$_['heading_title_cart'] 		 	 = 'Корзина';
$_['heading_title_light'] 		 	 = 'Оформление заказа';
$_['heading_title_customer'] 		 = 'Ваш заказ #%s сформирован!';

// Text
$_['text_cart']                      = 'Корзина покупок';
$_['text_checkout_account']          = 'Профиль и Платежная информация';
$_['text_checkout_payment_address']  = 'Платежная информация';
$_['text_checkout_shipping_address'] = 'Адрес доставки';
$_['text_checkout_shipping_method']  = 'Способ доставки';
$_['text_checkout_payment_method']   = 'Способ оплаты';
$_['text_checkout_confirm']          = 'Подтверждение заказа';
$_['text_modify']                    = 'Изменить &raquo;';
$_['text_new_customer']              = 'Новый покупатель';
$_['text_returning_customer']        = 'Постоянный покупатель';
$_['text_checkout']                  = 'Опции Оформления заказа:';
$_['text_i_am_returning_customer']   = 'Я совершал здесь покупки ранее и регистрировался';
$_['text_register']                  = 'Регистрация';
$_['text_login_light_checkout']      = 'Войти';
$_['text_checkout_guest'] 			 = 'Оформить заказ';
$_['text_guest']                     = 'Оформить заказ без регистрации';
$_['text_register_account']          = 'Создание учётной записи поможет делать покупки быстрее и удобнее. Вы также сможете отслеживать статус своего заказа, пользоваться Закладками, видеть свои предыдущие заказы или получить скидку как наш постоянный покупатель.';
$_['text_forgotten']                 = 'Забыли пароль?';
$_['text_your_details']              = 'Контактные данные';
$_['text_your_address']              = 'Ваш Адрес';
$_['text_your_password']             = 'Ваш пароль';
$_['text_agree']                     = 'Я прочитал(-а) <a href="%s" class="agree"><b>%s</b></a> и согласен(-на) с условиями';
$_['text_address_new']               = 'Я хочу использовать новый адрес';
$_['text_address_existing']          = 'Я хочу использовать существующий адрес';
$_['text_shipping_method']           = 'Выберите удобный способ доставки для этого заказа';
$_['text_payment_method']            = 'Выберите способ оплаты для этого заказа';
$_['text_comments']                  = 'Комментарий к заказу';
$_['text_recurring_item']            = 'Периодические платежи';
$_['text_payment_recurring']         = 'Платежный профиль';
$_['text_trial_description']         = 'Стоимость: %s; Периодичность: %d %s; Кол-во платежей: %d;  Далее,  ';
$_['text_payment_description']       = 'Стоимость: %s; Периодичность: %d %s; Кол-во платежей: %d';
$_['text_payment_cancel'] 			 = 'Стоимость: %s; Периодичность: %d %s; Кол-во платежей: до отмены';
$_['text_day']                       = 'День';
$_['text_week']                      = 'Неделя';
$_['text_semi_month']                = 'Полмесяца';
$_['text_month']                     = 'Месяц';
$_['text_year']                      = 'Год';


// Column
$_['column_name']                    = 'Название товара';
$_['column_model']                   = 'Код товара';
$_['column_quantity']                = 'Количество';
$_['column_price']                   = 'Цена за единицу товара';
$_['column_total']                   = 'Всего';

// Entry
$_['entry_email_address']            = 'E-Mail адрес';
$_['entry_email']                    = 'E-Mail';
$_['entry_password']                 = 'Пароль';
$_['entry_confirm']                  = 'Подтвердите пароль';
$_['entry_firstname']                = 'Имя';
$_['entry_lastname']                 = 'Фамилия';
$_['entry_telephone']                = 'Телефон';
$_['entry_fax']                      = 'Факс';
$_['entry_address']                  = 'Выберите адрес';
$_['entry_company']                  = 'Компания';
$_['entry_customer_group']           = 'Группа покупателей';
$_['entry_address_1']                = 'Адрес 1';
$_['entry_address_2']                = 'Адрес 2';
$_['entry_postcode']                 = 'Почтовый индекс';
$_['entry_city']                     = 'Город';
$_['entry_country']                  = 'Страна';
$_['entry_zone']                     = 'Регион / Область';
$_['entry_newsletter']               = 'Я хочу подписаться на рассылку новостей %s.';
$_['entry_shipping'] 	             = 'Мой адрес доставки совпадает с платёжным.';
$_['entry_lightcoupon'] 	         = 'Код купона';
$_['entry_lightreward']  			 = 'Доступно %s баллов';
$_['entry_lightapply'] 	         	 = 'Применить';
$_['entry_lightvoucher'] 	         = 'Подарочный сертификат';

// Error
$_['error_warning']                  = 'Возникла проблема при обработке вашего заказа! Если проблема возникает повторно, попробуйте выбрать другой способ оплаты или <a href="%s">свяжитесь с администратором магазина</a>.';
$_['error_login']                    = 'Не найден введённый адрес E-Mail и/или пароль указан неправильно.';
$_['error_attempts']                 = 'Ваша учетная запись превысила допустимое количество попыток входа в систему. Пожалуйста, попробуйте еще через 1 час.';
$_['error_approved']                 = 'Вы сможете войти после проверки учётной записи администрацией магазина.';
$_['error_exists']                   = 'Такой E-Mail уже зарегистрирован!';
$_['error_firstname']                = 'Имя должно содержать от 1 до 32 символов!';
$_['error_lastname']                 = 'Фамилия должна содержать от 1 до 32 символов!';
$_['error_email']                    = 'E-Mail адрес введен неверно!';
$_['error_telephone']                = 'Номер телефона должен содержать от 3 до 32 символов!';
$_['error_password']                 = 'Пароль должен содержать от 3 до 20 символов!';
$_['error_confirm']                  = 'Пароли не совпадают!';
$_['error_company']                  = 'Наименование Компании должно содержать от 1 до 128 символов!';
$_['error_address_1']                = 'Адрес должен содержать от 3 до 128 символов!';
$_['error_city']                     = 'Название города должно содержать от 2 до 128 символов!';
$_['error_postcode']                 = 'Индекс должен содержать от 2 до 10 символов!';
$_['error_country']                  = 'Пожалуйста, укажите страну!';
$_['error_zone']                     = 'Пожалуйста, укажите регион / область!';
$_['error_agree']                    = 'Вы должны прочитать и согласится с %s!';
$_['error_address']                  = 'Необходимо указать адрес!';
$_['error_shipping']                 = 'Необходимо указать способ доставки!';
$_['error_no_shipping']              = 'Доставка по данному адресу невозможна. <a href="%s">Свяжитесь с нами</a>, и мы найдём решение проблемы!';
$_['error_payment']                  = 'Необходимо указать способ оплаты!';
$_['error_no_payment']               = 'Оплата по данному адресу невозможна. Пожалуйста, <a href="%s">свяжитесь с нами</a> для решения этого вопроса!';
$_['error_custom_field']             = '%s необходим!';
$_['error_comment']                  = 'Комментарий должен содержать от 2 до 128 символов!';

$_['text_enter_login']               = 'Вы вошли как ';
$_['text_login_exit']                = 'Выйти';

// Empty Data Base
$_['text_empty_method']      		= 'Данные отсутствуют';

// Info
$_['text_min_summa']                = 'Сумма заказа не должна быть меньше %s';
$_['text_max_summa']                = 'Сумма заказа не должна быть больше %s';
$_['text_min_qty']                  = 'Количество каждого товара не должно быть меньше %s';
$_['text_max_qty']                	= 'Количество каждого товара не должно быть больше %s';
$_['text_min_weight']               = 'Вес товаров в корзине не должен быть меньше %s';
$_['text_max_weight']               = 'Вес товаров в корзине не должен быть больше %s';
$_['text_empty_guest']              = 'Для Оформления заказа заполните Ваш адрес';











